RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL33Z4/include/MKL33Z4_extension.h
/*
 * Constants & macros for individual LCD_AR bitfields
 */

/*!
 * @name Register LCD_AR, field BRATE[2:0] (RW)
 *
 * Selects frequency at which the LCD blinks when the BLINK bit is asserted. The
 * following equation provides an expression for the LCD controller blink rate
 * and shows how BRATE field is used in the LCD blink-rate calculation. LCD
 * controller blink rate = LCD clock /2(12 + BRATE)
 */
/*@{*/
/*! @brief Read current value of the LCD_AR_BRATE field. */
#define LCD_RD_AR_BRATE(base) ((LCD_AR_REG(base) & LCD_AR_BRATE_MASK) >> LCD_AR_BRATE_SHIFT)
#define LCD_BRD_AR_BRATE(base) (BME_UBFX32(&LCD_AR_REG(base), LCD_AR_BRATE_SHIFT, LCD_AR_BRATE_WIDTH))

/*! @brief Set the BRATE field to a new value. */
#define LCD_WR_AR_BRATE(base, value) (LCD_RMW_AR(base, LCD_AR_BRATE_MASK, LCD_AR_BRATE(value)))
#define LCD_BWR_AR_BRATE(base, value) (BME_BFI32(&LCD_AR_REG(base), ((uint32_t)(value) << LCD_AR_BRATE_SHIFT), LCD_AR_BRATE_SHIFT, LCD_AR_BRATE_WIDTH))
/*@}*/

/*!
 * @name Register LCD_AR, field BMODE[3] (RW)
 *
 * Selects the blink mode displayed during the blink period.
 *
 * Values:
 * - 0b0 - Display blank during the blink period.
 * - 0b1 - Display alternate display during blink period (Ignored if duty is 5
 *     or greater).
 */
/*@{*/
/*! @brief Read current value of the LCD_AR_BMODE field. */
#define LCD_RD_AR_BMODE(base) ((LCD_AR_REG(base) & LCD_AR_BMODE_MASK) >> LCD_AR_BMODE_SHIFT)
#define LCD_BRD_AR_BMODE(base) (BME_UBFX32(&LCD_AR_REG(base), LCD_AR_BMODE_SHIFT, LCD_AR_BMODE_WIDTH))

/*! @brief Set the BMODE field to a new value. */
#define LCD_WR_AR_BMODE(base, value) (LCD_RMW_AR(base, LCD_AR_BMODE_MASK, LCD_AR_BMODE(value)))
#define LCD_BWR_AR_BMODE(base, value) (BME_BFI32(&LCD_AR_REG(base), ((uint32_t)(value) << LCD_AR_BMODE_SHIFT), LCD_AR_BMODE_SHIFT, LCD_AR_BMODE_WIDTH))
/*@}*/

/*!
 * @name Register LCD_AR, field BLANK[5] (RW)
 *
 * Asserting this bit clears all segments in the LCD.
 *
 * Values:
 * - 0b0 - Normal or alternate display mode.
 * - 0b1 - Blank display mode.
 */
/*@{*/
/*! @brief Read current value of the LCD_AR_BLANK field. */
#define LCD_RD_AR_BLANK(base) ((LCD_AR_REG(base) & LCD_AR_BLANK_MASK) >> LCD_AR_BLANK_SHIFT)
#define LCD_BRD_AR_BLANK(base) (BME_UBFX32(&LCD_AR_REG(base), LCD_AR_BLANK_SHIFT, LCD_AR_BLANK_WIDTH))

/*! @brief Set the BLANK field to a new value. */
#define LCD_WR_AR_BLANK(base, value) (LCD_RMW_AR(base, LCD_AR_BLANK_MASK, LCD_AR_BLANK(value)))
#define LCD_BWR_AR_BLANK(base, value) (BME_BFI32(&LCD_AR_REG(base), ((uint32_t)(value) << LCD_AR_BLANK_SHIFT), LCD_AR_BLANK_SHIFT, LCD_AR_BLANK_WIDTH))
/*@}*/

/*!
 * @name Register LCD_AR, field ALT[6] (RW)
 *
 * For four back planes or less, the LCD back plane sequencer changes to output
 * an alternate display. ALT bit is ignored if DUTY[2:0] is 100 or greater.
 *
 * Values:
 * - 0b0 - Normal display mode.
 * - 0b1 - Alternate display mode.
 */
/*@{*/
/*! @brief Read current value of the LCD_AR_ALT field. */
#define LCD_RD_AR_ALT(base)  ((LCD_AR_REG(base) & LCD_AR_ALT_MASK) >> LCD_AR_ALT_SHIFT)
#define LCD_BRD_AR_ALT(base) (BME_UBFX32(&LCD_AR_REG(base), LCD_AR_ALT_SHIFT, LCD_AR_ALT_WIDTH))

/*! @brief Set the ALT field to a new value. */
#define LCD_WR_AR_ALT(base, value) (LCD_RMW_AR(base, LCD_AR_ALT_MASK, LCD_AR_ALT(value)))
#define LCD_BWR_AR_ALT(base, value) (BME_BFI32(&LCD_AR_REG(base), ((uint32_t)(value) << LCD_AR_ALT_SHIFT), LCD_AR_ALT_SHIFT, LCD_AR_ALT_WIDTH))
/*@}*/

/*!
 * @name Register LCD_AR, field BLINK[7] (RW)
 *
 * Starts or stops SLCD blinking.
 *
 * Values:
 * - 0b0 - Disables blinking.
 * - 0b1 - Starts blinking at blinking frequency specified by LCD blink rate
 *     calculation.
 */
/*@{*/
/*! @brief Read current value of the LCD_AR_BLINK field. */
#define LCD_RD_AR_BLINK(base) ((LCD_AR_REG(base) & LCD_AR_BLINK_MASK) >> LCD_AR_BLINK_SHIFT)
#define LCD_BRD_AR_BLINK(base) (BME_UBFX32(&LCD_AR_REG(base), LCD_AR_BLINK_SHIFT, LCD_AR_BLINK_WIDTH))

/*! @brief Set the BLINK field to a new value. */
#define LCD_WR_AR_BLINK(base, value) (LCD_RMW_AR(base, LCD_AR_BLINK_MASK, LCD_AR_BLINK(value)))
#define LCD_BWR_AR_BLINK(base, value) (BME_BFI32(&LCD_AR_REG(base), ((uint32_t)(value) << LCD_AR_BLINK_SHIFT), LCD_AR_BLINK_SHIFT, LCD_AR_BLINK_WIDTH))
/*@}*/

/*******************************************************************************
 * LCD_FDCR - LCD Fault Detect Control Register
 ******************************************************************************/

/*!
 * @brief LCD_FDCR - LCD Fault Detect Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
/*!
 * @name Constants and macros for entire LCD_FDCR register
 */
/*@{*/
#define LCD_RD_FDCR(base)        (LCD_FDCR_REG(base))
#define LCD_WR_FDCR(base, value) (LCD_FDCR_REG(base) = (value))
#define LCD_RMW_FDCR(base, mask, value) (LCD_WR_FDCR(base, (LCD_RD_FDCR(base) & ~(mask)) | (value)))
#define LCD_SET_FDCR(base, value) (BME_OR32(&LCD_FDCR_REG(base), (uint32_t)(value)))
#define LCD_CLR_FDCR(base, value) (BME_AND32(&LCD_FDCR_REG(base), (uint32_t)(~(value))))
#define LCD_TOG_FDCR(base, value) (BME_XOR32(&LCD_FDCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LCD_FDCR bitfields
 */

/*!
 * @name Register LCD_FDCR, field FDPINID[5:0] (RW)
 *
 * Specifies the LCD pin to be checked by pullup fault detection.
 *
 * Values:
 * - 0b000000 - Fault detection for LCD_P0 pin.
 * - 0b000001 - Fault detection for LCD_P1 pin.
 */
/*@{*/
/*! @brief Read current value of the LCD_FDCR_FDPINID field. */
#define LCD_RD_FDCR_FDPINID(base) ((LCD_FDCR_REG(base) & LCD_FDCR_FDPINID_MASK) >> LCD_FDCR_FDPINID_SHIFT)
#define LCD_BRD_FDCR_FDPINID(base) (BME_UBFX32(&LCD_FDCR_REG(base), LCD_FDCR_FDPINID_SHIFT, LCD_FDCR_FDPINID_WIDTH))

/*! @brief Set the FDPINID field to a new value. */
#define LCD_WR_FDCR_FDPINID(base, value) (LCD_RMW_FDCR(base, LCD_FDCR_FDPINID_MASK, LCD_FDCR_FDPINID(value)))
#define LCD_BWR_FDCR_FDPINID(base, value) (BME_BFI32(&LCD_FDCR_REG(base), ((uint32_t)(value) << LCD_FDCR_FDPINID_SHIFT), LCD_FDCR_FDPINID_SHIFT, LCD_FDCR_FDPINID_WIDTH))
/*@}*/

/*!
 * @name Register LCD_FDCR, field FDBPEN[6] (RW)
 *
 * Enables "back plane" timing for the fault detect circuit. FDBPEN = 0
 * generates front plane timing. This bit specifies the type of pin selected under fault
 * detect test.
 *
 * Values:
 * - 0b0 - Type of the selected pin under fault detect test is front plane.
 * - 0b1 - Type of the selected pin under fault detect test is back plane.
 */
/*@{*/
/*! @brief Read current value of the LCD_FDCR_FDBPEN field. */
#define LCD_RD_FDCR_FDBPEN(base) ((LCD_FDCR_REG(base) & LCD_FDCR_FDBPEN_MASK) >> LCD_FDCR_FDBPEN_SHIFT)
#define LCD_BRD_FDCR_FDBPEN(base) (BME_UBFX32(&LCD_FDCR_REG(base), LCD_FDCR_FDBPEN_SHIFT, LCD_FDCR_FDBPEN_WIDTH))

/*! @brief Set the FDBPEN field to a new value. */
#define LCD_WR_FDCR_FDBPEN(base, value) (LCD_RMW_FDCR(base, LCD_FDCR_FDBPEN_MASK, LCD_FDCR_FDBPEN(value)))
#define LCD_BWR_FDCR_FDBPEN(base, value) (BME_BFI32(&LCD_FDCR_REG(base), ((uint32_t)(value) << LCD_FDCR_FDBPEN_SHIFT), LCD_FDCR_FDBPEN_SHIFT, LCD_FDCR_FDBPEN_WIDTH))
/*@}*/

/*!
 * @name Register LCD_FDCR, field FDEN[7] (RW)
 *
 * If LCDEN is 1, asserting FDEN inserts a test frame after normal LCD refresh
 * frame is completed. After the test frame is done, Fault detection complete flag
 * (FDCF) is set. When the test frame is done, a normal LCD refresh frame
 * starts. FDEN is one-shot register, it clears after FDCF is set. To initiate another
 * fault detection, FDEN must be set again.
 *
 * Values:
 * - 0b0 - Disable fault detection.
 * - 0b1 - Enable fault detection.
 */
/*@{*/
/*! @brief Read current value of the LCD_FDCR_FDEN field. */
#define LCD_RD_FDCR_FDEN(base) ((LCD_FDCR_REG(base) & LCD_FDCR_FDEN_MASK) >> LCD_FDCR_FDEN_SHIFT)
#define LCD_BRD_FDCR_FDEN(base) (BME_UBFX32(&LCD_FDCR_REG(base), LCD_FDCR_FDEN_SHIFT, LCD_FDCR_FDEN_WIDTH))

/*! @brief Set the FDEN field to a new value. */
#define LCD_WR_FDCR_FDEN(base, value) (LCD_RMW_FDCR(base, LCD_FDCR_FDEN_MASK, LCD_FDCR_FDEN(value)))
#define LCD_BWR_FDCR_FDEN(base, value) (BME_BFI32(&LCD_FDCR_REG(base), ((uint32_t)(value) << LCD_FDCR_FDEN_SHIFT), LCD_FDCR_FDEN_SHIFT, LCD_FDCR_FDEN_WIDTH))
/*@}*/

/*!
 * @name Register LCD_FDCR, field FDSWW[11:9] (RW)
 *
 * Specifies the sample window width of fault detection, in number of cycles in
 * the range from 4-512 (Sample window = 4*2 N ).
 *
 * Values:
 * - 0b000 - Sample window width is 4 sample clock cycles.
 * - 0b001 - Sample window width is 8 sample clock cycles.
 */
/*@{*/
/*! @brief Read current value of the LCD_FDCR_FDSWW field. */
#define LCD_RD_FDCR_FDSWW(base) ((LCD_FDCR_REG(base) & LCD_FDCR_FDSWW_MASK) >> LCD_FDCR_FDSWW_SHIFT)
#define LCD_BRD_FDCR_FDSWW(base) (BME_UBFX32(&LCD_FDCR_REG(base), LCD_FDCR_FDSWW_SHIFT, LCD_FDCR_FDSWW_WIDTH))

