RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL33Z4/include/MKL33Z4_extension.h
/*! @brief Set the BPALCD20 field to a new value. */
#define LCD_WR_WF8B_BPALCD20(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD20_MASK, LCD_WF8B_BPALCD20(value)))
#define LCD_BWR_WF8B_BPALCD20(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD20_SHIFT), LCD_WF8B_BPALCD20_SHIFT, LCD_WF8B_BPALCD20_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD19[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD19 field. */
#define LCD_RD_WF8B_BPALCD19(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD19_MASK) >> LCD_WF8B_BPALCD19_SHIFT)
#define LCD_BRD_WF8B_BPALCD19(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD19_SHIFT, LCD_WF8B_BPALCD19_WIDTH))

/*! @brief Set the BPALCD19 field to a new value. */
#define LCD_WR_WF8B_BPALCD19(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD19_MASK, LCD_WF8B_BPALCD19(value)))
#define LCD_BWR_WF8B_BPALCD19(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD19_SHIFT), LCD_WF8B_BPALCD19_SHIFT, LCD_WF8B_BPALCD19_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD18[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD18 field. */
#define LCD_RD_WF8B_BPALCD18(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD18_MASK) >> LCD_WF8B_BPALCD18_SHIFT)
#define LCD_BRD_WF8B_BPALCD18(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD18_SHIFT, LCD_WF8B_BPALCD18_WIDTH))

/*! @brief Set the BPALCD18 field to a new value. */
#define LCD_WR_WF8B_BPALCD18(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD18_MASK, LCD_WF8B_BPALCD18(value)))
#define LCD_BWR_WF8B_BPALCD18(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD18_SHIFT), LCD_WF8B_BPALCD18_SHIFT, LCD_WF8B_BPALCD18_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD17[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD17 field. */
#define LCD_RD_WF8B_BPALCD17(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD17_MASK) >> LCD_WF8B_BPALCD17_SHIFT)
#define LCD_BRD_WF8B_BPALCD17(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD17_SHIFT, LCD_WF8B_BPALCD17_WIDTH))

/*! @brief Set the BPALCD17 field to a new value. */
#define LCD_WR_WF8B_BPALCD17(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD17_MASK, LCD_WF8B_BPALCD17(value)))
#define LCD_BWR_WF8B_BPALCD17(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD17_SHIFT), LCD_WF8B_BPALCD17_SHIFT, LCD_WF8B_BPALCD17_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD16[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD16 field. */
#define LCD_RD_WF8B_BPALCD16(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD16_MASK) >> LCD_WF8B_BPALCD16_SHIFT)
#define LCD_BRD_WF8B_BPALCD16(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD16_SHIFT, LCD_WF8B_BPALCD16_WIDTH))

/*! @brief Set the BPALCD16 field to a new value. */
#define LCD_WR_WF8B_BPALCD16(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD16_MASK, LCD_WF8B_BPALCD16(value)))
#define LCD_BWR_WF8B_BPALCD16(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD16_SHIFT), LCD_WF8B_BPALCD16_SHIFT, LCD_WF8B_BPALCD16_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD15[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD15 field. */
#define LCD_RD_WF8B_BPALCD15(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD15_MASK) >> LCD_WF8B_BPALCD15_SHIFT)
#define LCD_BRD_WF8B_BPALCD15(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD15_SHIFT, LCD_WF8B_BPALCD15_WIDTH))

/*! @brief Set the BPALCD15 field to a new value. */
#define LCD_WR_WF8B_BPALCD15(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD15_MASK, LCD_WF8B_BPALCD15(value)))
#define LCD_BWR_WF8B_BPALCD15(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD15_SHIFT), LCD_WF8B_BPALCD15_SHIFT, LCD_WF8B_BPALCD15_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD7[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD7 field. */
#define LCD_RD_WF8B_BPALCD7(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD7_MASK) >> LCD_WF8B_BPALCD7_SHIFT)
#define LCD_BRD_WF8B_BPALCD7(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD7_SHIFT, LCD_WF8B_BPALCD7_WIDTH))

/*! @brief Set the BPALCD7 field to a new value. */
#define LCD_WR_WF8B_BPALCD7(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD7_MASK, LCD_WF8B_BPALCD7(value)))
#define LCD_BWR_WF8B_BPALCD7(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD7_SHIFT), LCD_WF8B_BPALCD7_SHIFT, LCD_WF8B_BPALCD7_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD14[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD14 field. */
#define LCD_RD_WF8B_BPALCD14(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD14_MASK) >> LCD_WF8B_BPALCD14_SHIFT)
#define LCD_BRD_WF8B_BPALCD14(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD14_SHIFT, LCD_WF8B_BPALCD14_WIDTH))

/*! @brief Set the BPALCD14 field to a new value. */
#define LCD_WR_WF8B_BPALCD14(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD14_MASK, LCD_WF8B_BPALCD14(value)))
#define LCD_BWR_WF8B_BPALCD14(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD14_SHIFT), LCD_WF8B_BPALCD14_SHIFT, LCD_WF8B_BPALCD14_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD13[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD13 field. */
#define LCD_RD_WF8B_BPALCD13(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD13_MASK) >> LCD_WF8B_BPALCD13_SHIFT)
#define LCD_BRD_WF8B_BPALCD13(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD13_SHIFT, LCD_WF8B_BPALCD13_WIDTH))

/*! @brief Set the BPALCD13 field to a new value. */
#define LCD_WR_WF8B_BPALCD13(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD13_MASK, LCD_WF8B_BPALCD13(value)))
#define LCD_BWR_WF8B_BPALCD13(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD13_SHIFT), LCD_WF8B_BPALCD13_SHIFT, LCD_WF8B_BPALCD13_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD12[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD12 field. */
#define LCD_RD_WF8B_BPALCD12(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD12_MASK) >> LCD_WF8B_BPALCD12_SHIFT)
#define LCD_BRD_WF8B_BPALCD12(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD12_SHIFT, LCD_WF8B_BPALCD12_WIDTH))

