RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL33Z4/include/MKL33Z4_extension.h
/*! @brief Set the BPCLCD24 field to a new value. */
#define LCD_WR_WF8B_BPCLCD24(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD24_MASK, LCD_WF8B_BPCLCD24(value)))
#define LCD_BWR_WF8B_BPCLCD24(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD24_SHIFT), LCD_WF8B_BPCLCD24_SHIFT, LCD_WF8B_BPCLCD24_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD60[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD60 field. */
#define LCD_RD_WF8B_BPCLCD60(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD60_MASK) >> LCD_WF8B_BPCLCD60_SHIFT)
#define LCD_BRD_WF8B_BPCLCD60(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD60_SHIFT, LCD_WF8B_BPCLCD60_WIDTH))

/*! @brief Set the BPCLCD60 field to a new value. */
#define LCD_WR_WF8B_BPCLCD60(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD60_MASK, LCD_WF8B_BPCLCD60(value)))
#define LCD_BWR_WF8B_BPCLCD60(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD60_SHIFT), LCD_WF8B_BPCLCD60_SHIFT, LCD_WF8B_BPCLCD60_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD47[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD47 field. */
#define LCD_RD_WF8B_BPCLCD47(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD47_MASK) >> LCD_WF8B_BPCLCD47_SHIFT)
#define LCD_BRD_WF8B_BPCLCD47(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD47_SHIFT, LCD_WF8B_BPCLCD47_WIDTH))

/*! @brief Set the BPCLCD47 field to a new value. */
#define LCD_WR_WF8B_BPCLCD47(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD47_MASK, LCD_WF8B_BPCLCD47(value)))
#define LCD_BWR_WF8B_BPCLCD47(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD47_SHIFT), LCD_WF8B_BPCLCD47_SHIFT, LCD_WF8B_BPCLCD47_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD22[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD22 field. */
#define LCD_RD_WF8B_BPCLCD22(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD22_MASK) >> LCD_WF8B_BPCLCD22_SHIFT)
#define LCD_BRD_WF8B_BPCLCD22(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD22_SHIFT, LCD_WF8B_BPCLCD22_WIDTH))

/*! @brief Set the BPCLCD22 field to a new value. */
#define LCD_WR_WF8B_BPCLCD22(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD22_MASK, LCD_WF8B_BPCLCD22(value)))
#define LCD_BWR_WF8B_BPCLCD22(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD22_SHIFT), LCD_WF8B_BPCLCD22_SHIFT, LCD_WF8B_BPCLCD22_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD8[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD8 field. */
#define LCD_RD_WF8B_BPCLCD8(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD8_MASK) >> LCD_WF8B_BPCLCD8_SHIFT)
#define LCD_BRD_WF8B_BPCLCD8(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD8_SHIFT, LCD_WF8B_BPCLCD8_WIDTH))

/*! @brief Set the BPCLCD8 field to a new value. */
#define LCD_WR_WF8B_BPCLCD8(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD8_MASK, LCD_WF8B_BPCLCD8(value)))
#define LCD_BWR_WF8B_BPCLCD8(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD8_SHIFT), LCD_WF8B_BPCLCD8_SHIFT, LCD_WF8B_BPCLCD8_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD21[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD21 field. */
#define LCD_RD_WF8B_BPCLCD21(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD21_MASK) >> LCD_WF8B_BPCLCD21_SHIFT)
#define LCD_BRD_WF8B_BPCLCD21(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD21_SHIFT, LCD_WF8B_BPCLCD21_WIDTH))

/*! @brief Set the BPCLCD21 field to a new value. */
#define LCD_WR_WF8B_BPCLCD21(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD21_MASK, LCD_WF8B_BPCLCD21(value)))
#define LCD_BWR_WF8B_BPCLCD21(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD21_SHIFT), LCD_WF8B_BPCLCD21_SHIFT, LCD_WF8B_BPCLCD21_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD49[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD49 field. */
#define LCD_RD_WF8B_BPCLCD49(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD49_MASK) >> LCD_WF8B_BPCLCD49_SHIFT)
#define LCD_BRD_WF8B_BPCLCD49(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD49_SHIFT, LCD_WF8B_BPCLCD49_WIDTH))

/*! @brief Set the BPCLCD49 field to a new value. */
#define LCD_WR_WF8B_BPCLCD49(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD49_MASK, LCD_WF8B_BPCLCD49(value)))
#define LCD_BWR_WF8B_BPCLCD49(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD49_SHIFT), LCD_WF8B_BPCLCD49_SHIFT, LCD_WF8B_BPCLCD49_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD25[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD25 field. */
#define LCD_RD_WF8B_BPCLCD25(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD25_MASK) >> LCD_WF8B_BPCLCD25_SHIFT)
#define LCD_BRD_WF8B_BPCLCD25(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD25_SHIFT, LCD_WF8B_BPCLCD25_WIDTH))

/*! @brief Set the BPCLCD25 field to a new value. */
#define LCD_WR_WF8B_BPCLCD25(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD25_MASK, LCD_WF8B_BPCLCD25(value)))
#define LCD_BWR_WF8B_BPCLCD25(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD25_SHIFT), LCD_WF8B_BPCLCD25_SHIFT, LCD_WF8B_BPCLCD25_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD1[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD1 field. */
#define LCD_RD_WF8B_BPCLCD1(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD1_MASK) >> LCD_WF8B_BPCLCD1_SHIFT)
#define LCD_BRD_WF8B_BPCLCD1(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD1_SHIFT, LCD_WF8B_BPCLCD1_WIDTH))

/*! @brief Set the BPCLCD1 field to a new value. */
#define LCD_WR_WF8B_BPCLCD1(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD1_MASK, LCD_WF8B_BPCLCD1(value)))
#define LCD_BWR_WF8B_BPCLCD1(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD1_SHIFT), LCD_WF8B_BPCLCD1_SHIFT, LCD_WF8B_BPCLCD1_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD20[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD20 field. */
#define LCD_RD_WF8B_BPCLCD20(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD20_MASK) >> LCD_WF8B_BPCLCD20_SHIFT)
#define LCD_BRD_WF8B_BPCLCD20(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD20_SHIFT, LCD_WF8B_BPCLCD20_WIDTH))

/*! @brief Set the BPCLCD20 field to a new value. */
#define LCD_WR_WF8B_BPCLCD20(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD20_MASK, LCD_WF8B_BPCLCD20(value)))
#define LCD_BWR_WF8B_BPCLCD20(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD20_SHIFT), LCD_WF8B_BPCLCD20_SHIFT, LCD_WF8B_BPCLCD20_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD50[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD50 field. */
#define LCD_RD_WF8B_BPCLCD50(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD50_MASK) >> LCD_WF8B_BPCLCD50_SHIFT)
#define LCD_BRD_WF8B_BPCLCD50(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD50_SHIFT, LCD_WF8B_BPCLCD50_WIDTH))

